UWARG/efs-zeropilot-3.5b/stm32l552xx/boardfiles/model/src/drivers.cpp
#include "drivers.hpp"
#include "zp_bit.hpp"
#include "museq.hpp"
#include "stm32l5xx_hal.h"
#include "zp_params.hpp"

#define MOT_TYPE_PWM   0
#define MOT_TYPE_DSHOT 5

// External hardware handles
extern IWDG_HandleTypeDef hiwdg;
extern TIM_HandleTypeDef htim1;
extern TIM_HandleTypeDef htim3;
extern TIM_HandleTypeDef htim4;
extern UART_HandleTypeDef huart2;
extern UART_HandleTypeDef huart3;
extern UART_HandleTypeDef huart4;
extern SPI_HandleTypeDef hspi2;
extern I2C_HandleTypeDef hi2c1;
extern I2C_HandleTypeDef hi2c2;
extern I2C_HandleTypeDef hi2c3;
extern FDCAN_HandleTypeDef hfdcan1;

// ----------------------------------------------------------------------------
// Global handles
// ----------------------------------------------------------------------------
SystemUtils *systemUtilsHandle = nullptr;
MathUtils *mathUtilsHandle = nullptr;
FFT *fftHandle = nullptr;
IndependentWatchdog *iwdgHandle = nullptr;
Logger *loggerHandle = nullptr;

IMotorControl *motorHandles[8] = {0};

CANController *canControllerHandle = nullptr;
GPS *gpsHandle = nullptr;
CRSFReceiver *rcHandle = nullptr;
RFD *telemLinkHandle = nullptr;
IMU *imuHandle = nullptr;
Barometer *barometerHandle = nullptr;
PowerModule *pmHandle = nullptr;
Rangefinder *rangefinderHandle = nullptr;

MessageQueue<RCMotorControlMessage_t> *amRCQueueHandle = nullptr;
MessageQueue<char[100]> *smLoggerQueueHandle = nullptr;
MessageQueue<TMMessage_t> *tmQueueHandle = nullptr;
MessageQueue<mavlink_message_t> *messageBufferHandle = nullptr;

// ----------------------------------------------------------------------------
// Motor instances & group
// ----------------------------------------------------------------------------
MotorInstance_t motorInstances[8];
MotorGroupInstance_t mainMotorGroup;

typedef struct {
    TIM_HandleTypeDef *timer;
    uint32_t channel;
} motorChannel_t;

const motorChannel_t MOTOR_MAP[8] = {
    {&htim3, TIM_CHANNEL_1}, {&htim3, TIM_CHANNEL_2}, {&htim3, TIM_CHANNEL_3}, {&htim3, TIM_CHANNEL_4},
    {&htim4, TIM_CHANNEL_1}, {&htim1, TIM_CHANNEL_1}, {&htim1, TIM_CHANNEL_2}, {&htim1, TIM_CHANNEL_3},
};

const ZP_PARAM_ID SERVO_FUNC[8] = {
    ZP_PARAM_ID::SERVO1_FUNCTION, ZP_PARAM_ID::SERVO2_FUNCTION,
    ZP_PARAM_ID::SERVO3_FUNCTION, ZP_PARAM_ID::SERVO4_FUNCTION,
    ZP_PARAM_ID::SERVO5_FUNCTION, ZP_PARAM_ID::SERVO6_FUNCTION,
    ZP_PARAM_ID::SERVO7_FUNCTION, ZP_PARAM_ID::SERVO8_FUNCTION,
};

// ----------------------------------------------------------------------------
// Initialization
// ----------------------------------------------------------------------------
void initDrivers()
{
    // 1. Core utilities
    fftHandle = new FFT();
    systemUtilsHandle = new SystemUtils();

    // BIT needs the millisecond clock, so it starts as soon as SystemUtils exists and before any
    // driver init result is reported. Nothing to trap on: if it cannot start, reports no-op.
    (void)ZP_BIT::init(systemUtilsHandle);
    mathUtilsHandle = new MathUtils();
    iwdgHandle = new IndependentWatchdog(&hiwdg);
    loggerHandle = new Logger();

    // 2. Motors (Fail-fast on parameter read)
    float val = 0.0f;
    ZP_Error paramStatus = ZP_PARAM::get(ZP_PARAM_ID::MOT_PWM_TYPE, val);
    
    uint32_t servoType = static_cast<uint32_t>(val);
    
    for (int i = 0; i < 8; i++) {
        // Determine if it is brushless DC motor
        float funcVal = 0.0f;
        paramStatus |= ZP_PARAM::get(SERVO_FUNC[i], funcVal);

        MotorFunction_e func = static_cast<MotorFunction_e>(static_cast<int>(funcVal));
        bool isBLDC = false;
    #ifdef PLANE
        isBLDC = (func == MotorFunction_e::THROTTLE);
    #endif
    #ifdef QUADCOPTER
        isBLDC = (func == MotorFunction_e::MOTOR_1) || (func == MotorFunction_e::MOTOR_2)
              || (func == MotorFunction_e::MOTOR_3) || (func == MotorFunction_e::MOTOR_4);
    #endif
        if (isBLDC) {
            switch (servoType) {
                case MOT_TYPE_DSHOT: // DShot
                    motorHandles[i] = new DshotMotorControl(MOTOR_MAP[i].timer, MOTOR_MAP[i].channel, false);
                    break;
                case MOT_TYPE_PWM: // PWM
                default:
                    motorHandles[i] = new MotorControl(MOTOR_MAP[i].timer, MOTOR_MAP[i].channel, 5, 10, i + 1);
                    break;
            }
        } else {
            motorHandles[i] = new MotorControl(MOTOR_MAP[i].timer, MOTOR_MAP[i].channel, 5, 10, i + 1);
        }
    }

    canControllerHandle = new CANController(&hfdcan1, systemUtilsHandle);

    // 3. Peripheral allocation
    gpsHandle = new GPS(&huart2);
    rcHandle = new CRSFReceiver(&huart4);
    telemLinkHandle = new RFD(&huart3);
    imuHandle = new IMU(&hspi2, GPIOF, GPIO_PIN_12, 0, IMU_ODR_1KHZ);
    pmHandle = new PowerModule(&hi2c1);
    float rngfndEnable = 0.0f;
    paramStatus |= ZP_PARAM::get(ZP_PARAM_ID::RNGFND_ENABLE, rngfndEnable);
    if (static_cast<int>(rngfndEnable) == 1) {
        rangefinderHandle = new Rangefinder(&hi2c3);
    }
    barometerHandle = new Barometer(&hi2c2);

    // 4. Queue allocation
    amRCQueueHandle = new MessageQueue<RCMotorControlMessage_t>(&amQueueId);
    smLoggerQueueHandle = new MessageQueue<char[100]>(&smLoggerQueueId);
    tmQueueHandle = new MessageQueue<TMMessage_t>(&tmQueueId);
    messageBufferHandle = new MessageQueue<mavlink_message_t>(&messageBufferId);

    // 5. Hardware Initialization (Fail-Fast)
    for (int i = 0; i < 8; i++) {
        (void)ZP_BIT::report(ZP_BIT_ID::MOTOR_INIT, motorHandles[i]->init());
    }

    (void)ZP_BIT::report(ZP_BIT_ID::RC_INIT, rcHandle->init());
    (void)ZP_BIT::report(ZP_BIT_ID::TELEM_INIT, telemLinkHandle->init());
    // These ifaces still return bool/int; Stage D0 converts them to ZP_Error.
    (void)ZP_BIT::report(ZP_BIT_ID::GPS_INIT, gpsHandle->init() ? ZP_ERROR_OK : ZP_ERROR_FAIL);
    (void)ZP_BIT::report(ZP_BIT_ID::IMU_INIT, (imuHandle->init() == 0) ? ZP_ERROR_OK : ZP_ERROR_FAIL);
    (void)ZP_BIT::report(ZP_BIT_ID::PM_INIT, pmHandle->init());
    if (rangefinderHandle != nullptr) {
        (void)ZP_BIT::report(ZP_BIT_ID::RANGEFINDER_INIT,
                             (rangefinderHandle->init() == 0) ? ZP_ERROR_OK : ZP_ERROR_FAIL);
    }
    (void)ZP_BIT::report(ZP_BIT_ID::BARO_INIT, barometerHandle->init() ? ZP_ERROR_OK : ZP_ERROR_FAIL);

    // 6. Finalize structure
    for (int i = 0; i < 8; i++) {
        motorInstances[i] = {motorHandles[i]};
    }
    mainMotorGroup = {motorInstances, 8};

    // A param read failing here is a param-table problem, so it lands on the same BIT that
    // ZP_PARAM::init() reports to. Nothing is returned: every failure is already recorded.
    (void)ZP_BIT::report(ZP_BIT_ID::PARAM_TABLE_INIT, paramStatus);
}